walker_server/app/controllers/api_controller.rb

	def get_list
		render :json => User.all
---
SELECT "users".* FROM "users"

	def registerUser
		response = Hash.new

		if params[:name] != nil and params[:pass] != nil
			unless User.where(:name).empty?
				response = {:result => :failed,:message => "specified name is already existing"}
				render :json => response
				return nil
			end

			user = User.new
			user.name = params[:name]
			user.pass = params[:pass]
			while user.userhash == nil do
				tmp = ((1..9).to_a + ('a'..'z').to_a).sample(25).join
				user.userhash = tmp if User.where(:userhash => tmp).empty?
			end

			mystep = Step.new
			mystep.save
			user.step_id = mystep.id

			user.save
---
SELECT COUNT(*) FROM "users"  WHERE ('name')
SELECT COUNT(*) FROM "users"  WHERE "users"."userhash" = 'vxkwwpwqtfwovzelojwvdpawdw'
INSERT INTO "steps" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-01-11 10:57:33.627705"], ["updated_at", "2015-01-11 10:57:33.627705"]]
INSERT INTO "users" ("created_at", "name", "pass", "step_id", "updated_at", "userhash") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-11 10:57:33.681601"], ["name", "temp"], ["pass", "password"], ["step_id", 1], ["updated_at", "2015-01-11 10:57:33.681601"], ["userhash", "luamxmoxfecmsfzpdhpxauijoj"]]

	def getUserhash
		response = Hash.new
		users = User.where(:name => params[:name],:pass => params[:pass])
		if users.empty?
---
SELECT  "users".* FROM "users"  WHERE "users"."name" = 'temp' AND "users"."pass" = 'password'  ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "users"  WHERE "users"."name" = 'temp' AND "users"."pass" = 'password'

	def addStep
		Steplog.new(:userhash => params[:userhash],:step => params[:step]).save
		mystep = Step.find(StepUser.find_by_user_id(User.find_by_userhash(params[:userhash]).id).step_id)
		response = Hash.new
		if mystep
			addition = params[:step].to_i
			mystep.update(:stock_step => mystep.stock_step + addition ,:total_step => mystep.total_step + addition)
---
INSERT INTO "steplogs" ("created_at", "step", "updated_at", "userhash") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-23 09:49:12.405865"], ["step", 8], ["updated_at", "2015-01-23 09:49:12.405865"], ["userhash", "j1fw8vg9z57mr4c3biyohulk6"]]
UPDATE "steps" SET "stock_step" = ?, "total_step" = ?, "updated_at" = ? WHERE "steps"."id" = 1  [["stock_step", 600], ["total_step", 200], ["updated_at", "2015-01-12 08:23:54.325806"]]

	def getStep
		response = Hash.new
		mystep = Step.find(User.where(:userhash => params[:userhash]).first.step_id)
---
SELECT  "users".* FROM "users"  WHERE "users"."userhash" = 'kyweuyfoyfvfczlwxwqsjcdhrp'  ORDER BY "users"."id" ASC LIMIT 1

	def getGpsQuestList
		render :json => Gpsquest.all
---
SELECT "gpsquests".* FROM "gpsquests"

	def postLocation
		Gpslog.new(:userhash => params[:userhash],:longitude => params[:longitude].to_f,:latitude => params[:latitude].to_f).save

		lon_threshold = 0.005
		lati_threshold = 0.012

		response = Hash.new
		myuser = User.find_by_userhash(params[:userhash])

		target_quest = Gpsquest.where(:longitude => ((params[:longitude].to_f-lon_threshold)..(params[:longitude].to_f+lon_threshold)),:latitude => ((params[:latitude].to_f-lati_threshold)..(params[:latitude].to_f+lati_threshold))).first

		if(target_quest and myuser)

			new_item = ItemsUsers.new
			new_item.user_id = myuser.id
			new_item.item_id = target_quest.reward
			new_item.save
---
INSERT INTO "gpslogs" ("created_at", "latitude", "longitude", "updated_at", "userhash") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-01-23 11:45:33.119600"], ["latitude", 0.0], ["longitude", 0.0], ["updated_at", "2015-01-23 11:45:33.119600"], ["userhash", "j1fw8vg9z57mr4c3biyohulk6"]]
SELECT  "users".* FROM "users"  WHERE "users"."userhash" = 'j1fw8vg9z57mr4c3biyohulk6'  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "gpsquests".* FROM "gpsquests"  WHERE ("gpsquests"."longitude" BETWEEN 134.6358124 AND 134.6958124) AND ("gpsquests"."latitude" BETWEEN 33.8932017 AND 33.9532017)  ORDER BY "gpsquests"."id" ASC LIMIT 1
INSERT INTO "items_users" ("created_at", "item_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-23 12:04:24.673104"], ["item_id", 1], ["updated_at", "2015-01-23 12:04:24.673104"], ["user_id", 1]]

	def postQRcode
		Qrlog.new(:userhash => params[:userhash],:code => params[:code]).save()
		response = Hash.new()
		event = Qrevent.find_by_code(params[:code]).reward
		user = User.find_by_userhash(params[:userhash]).id
		if(!event || !user)
			response = {:result => :failed}
		elsif(ItemsUsers.new(:item_id => event, :user_id => user).save)
---
INSERT INTO "qrlogs" ("code", "created_at", "updated_at", "userhash") VALUES (?, ?, ?, ?)  [["code", "5hq4tkcu1snrijg83y9zlebvf"], ["created_at", "2015-01-23 17:47:43.606394"], ["updated_at", "2015-01-23 17:47:43.606394"], ["userhash", "kyweuyfoyfvfczlwxwqsjcdhrp"]]
SELECT  "qrevents".* FROM "qrevents"  WHERE "qrevents"."code" = '5hq4tkcu1snrijg83y9zlebvf' LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."userhash" = 'kyweuyfoyfvfczlwxwqsjcdhrp' LIMIT 1
INSERT INTO "items_users" ("created_at", "item_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-23 18:00:50.726323"], ["item_id", 1], ["updated_at", "2015-01-23 18:00:50.726323"], ["user_id", 1]]