walker_server/app/controllers/api_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."name" = 'Oriishi' AND "users"."pass" = 'hogehoge'  ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "users"  WHERE "users"."name" = 'Oriishi' AND "users"."pass" = 'hogehoge'
SELECT  "users".* FROM "users"  WHERE "users"."name" = 'Oriishi'  ORDER BY "users"."id" ASC LIMIT 1000
---
	def get_user_hash
		response = Hash.new
		users = User.where(:name => params[:name],:pass => params[:pass])
		if users.empty?
			response[:result] = "failed"
		else
			response[:result] = "success"
			response[:userhash] = users.first.userhash

INSERT INTO "users" ("created_at", "name", "pass", "updated_at", "userhash") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-01-08 03:36:56.000000"], ["name", "temp"], ["pass", "password"], ["updated_at", "2015-01-08 03:36:56.000000"], ["userhash", "DZMMTNVEZNWOTMORNEUZFQIWZT"]]
---
	def register_user
		response = Hash.new
		if params[:user] != nil or params[:pass] != nil
			user = User.new
			colmuns = ['user','pass','userhash','created_at','updated_at']
			user.name = params[:user]
			user.pass = params[:pass]
			user.userhash = (0..15).map{('a'..'z').to_a[rand(26)]}.join
			user.created_at = Time.now.to_s.split("+")[0]