walker_server/app/controllers/api_controller.rb

SELECT "gpsquests".* FROM "gpsquests"  WHERE "gpsquests"."flag" = 1
---
	def getGpsQuestList
		render :json => Gpsquest.where(:flag => 1)

SELECT  "gpsquests".* FROM "gpsquests"  WHERE "gpsquests"."id" = 0  ORDER BY "gpsquests"."id" ASC LIMIT 1
---
	def postLocation
		Gpslog.new(:userhash => params[:userhash],:longitude => params[:longitude].to_f,:latitude => params[:latitude].to_f).save

		threshold = 1.1
		response = Hash.new
		myuser = User.find_by_userhash(params[:userhash])
		target_quest = Gpsquest.find(params[:id].to_i)