walker_server/app/controllers/game_api_controller.rb

	def getStep
		unless @response[0]
			if mystep = Step.find_by(:id => @user.id)
---
SELECT  "steps".* FROM "steps"  WHERE "steps"."id" = 1 LIMIT 1