walker_server/app/controllers/game_api_controller.rb

SELECT  "items_users".* FROM "items_users"  WHERE "items_users"."user_id" = 1 AND "items_users"."item_id" = 1 LIMIT 1
SELECT "items".* FROM "items"
---
	def getItemEntity
		unless @response[0]
			@response.push(:result => :succeed)
			hasitem = ItemsUsers.find_by(:user_id => @user.id)
			Item.all.each { |item|

SELECT  "step_users".* FROM "step_users"  WHERE "step_users"."user_id" = 1 LIMIT 1
---
	def getStep
		unless @response[0]
			if mystep = Step.find(StepUser.find_by(:user_id => @user.id).step_id)

SELECT  "step_users".* FROM "step_users"  WHERE "step_users"."user_id" = 1 LIMIT 1
UPDATE "steps" SET "stock_step" = ?, "updated_at" = ? WHERE "steps"."id" = 1  [["stock_step", 10], ["updated_at", "2015-03-21 13:19:14.944939"]]
---
	def postStep
		unless @response[0]
			if mystep = Step.find(StepUser.find_by(:user_id => @user.id).step_id)
				mystep.stock_step = params[:step]
				mystep.save