walker_server/app/controllers/gpslogs_controller.rb

  def index
    @gpslogs = Gpslog.all
---
SELECT "gpslogs".* FROM "gpslogs"