walker_server/app/controllers/gpsquests_controller.rb

  def index
    @gpsquests = Gpsquest.all
---
SELECT "gpsquests".* FROM "gpsquests"

  def create
    @gpsquest = Gpsquest.new(gpsquest_params)

    respond_to do |format|
      if @gpsquest.save
---
INSERT INTO "gpsquests" ("created_at", "destination", "latitude", "longitude", "reward", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-01-23 10:45:09.821819"], ["destination", "阿南工業高等専門学校"], ["latitude", 33.897971], ["longitude", 134.667418], ["reward", 1], ["updated_at", "2015-01-23 10:45:09.821819"]]

  def update
    respond_to do |format|
      if @gpsquest.update(gpsquest_params)
---
UPDATE "gpsquests" SET "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "gpsquests"."id" = 2  [["latitude", 33.924538], ["longitude", 134.666026], ["updated_at", "2015-01-25 13:07:12.420018"]]

    def set_gpsquest
      @gpsquest = Gpsquest.find(params[:id])
---
SELECT  "gpsquests".* FROM "gpsquests"  WHERE "gpsquests"."id" = ? LIMIT 1  [["id", 2]]