walker_server/app/controllers/items_controller.rb

INSERT INTO "items" ("created_at", "description", "effective_term", "effective_value", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-03-19 17:00:32.820222"], ["description", "first item"], ["effective_term", 60], ["effective_value", 100], ["name", "atk_upper"], ["updated_at", "2015-03-19 17:00:32.820222"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = 1  [["description", "石の剣は世界一ィィィィ！"], ["updated_at", "2015-01-25 12:09:52.667073"]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)