walker_server/app/controllers/items_users_controller.rb

  def index
    @items_users = ItemsUser.all
---
SELECT "items_users".* FROM "items_users"