walker_server/app/controllers/qrevents_controller.rb

  def index
    @qrevents = Qrevent.all
---
SELECT "qrevents".* FROM "qrevents"

  def create
    @qrevent = Qrevent.new(qrevent_params)

    respond_to do |format|
      if @qrevent.save
---
INSERT INTO "qrevents" ("code", "created_at", "reward", "updated_at") VALUES (?, ?, ?, ?)  [["code", "5hq4tkcu1snrijg83y9zlebvf"], ["created_at", "2015-01-23 17:03:08.777441"], ["reward", 1], ["updated_at", "2015-01-23 17:03:08.777441"]]

    def set_qrevent
      @qrevent = Qrevent.find(params[:id])
---
SELECT  "qrevents".* FROM "qrevents"  WHERE "qrevents"."id" = ? LIMIT 1  [["id", 1]]