walker_server/app/controllers/sensor_api_controller.rb

	def getGpsQuestList
		if User.find_by(:userhash => params[:userhash])
			response = {:result => :succeed}
			lat = params[:latitude]
			lon = params[:longitude]
			Gpsquest.order("((latitude-#{lat})*(latitude-#{lat})+(longitude-#{lon})*(longitude-#{lon})) asc").limit(5).each_with_index { |quest,index|
---
SELECT  "users".* FROM "users"  WHERE "users"."userhash" = 'brj31inwqezl4ukg87vxd2h5o' LIMIT 1
SELECT  "gpsquests".* FROM "gpsquests"   ORDER BY ((latitude-0)*(latitude-0)+(longitude-0)*(longitude-0)) asc LIMIT 5

	def postStep
		Steplog.new(:userhash => params[:userhash],:step => params[:step]).save
		mystep = Step.find(StepUser.find_by(:user_id => User.find_by(:userhash => params[:userhash]).id).step_id)
		response = Hash.new
		if mystep
			addition = params[:step].to_i
			mystep.update(:stock_step => mystep.stock_step + addition ,:total_step => mystep.total_step + addition)
---
INSERT INTO "steplogs" ("created_at", "step", "updated_at", "userhash") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-21 07:04:59.683916"], ["step", 33], ["updated_at", "2015-03-21 07:04:59.683916"], ["userhash", "brj31inwqezl4ukg87vxd2h5o"]]
UPDATE "steps" SET "stock_step" = ?, "total_step" = ?, "updated_at" = ? WHERE "steps"."id" = 1  [["stock_step", 48], ["total_step", 48], ["updated_at", "2015-03-21 07:04:59.700997"]]

	def postQRcode
		Qrlog.new(:userhash => params[:userhash],:code => params[:code]).save()
		response = Hash.new()
		event = Qrevent.find_by(:code => params[:code])
		user = User.find_by(:userhash => params[:userhash])
		if(!event || !user)
			response = {:result => :failed}
		elsif(hasitem = ItemsUsers.find_or_create_by(:item_id => event.reward, :user_id => user.id) {|iu| iu.amount = 0})
			hasitem.amount+=1
			hasitem.save
---
INSERT INTO "qrlogs" ("code", "created_at", "updated_at", "userhash") VALUES (?, ?, ?, ?)  [["code", "hack_u_kosen"], ["created_at", "2015-03-21 03:27:44.328680"], ["updated_at", "2015-03-21 03:27:44.328680"], ["userhash", "brj31inwqezl4ukg87vxd2h5o"]]
SELECT  "qrevents".* FROM "qrevents"  WHERE "qrevents"."code" = 'hack_u_kosen' LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."userhash" = 'brj31inwqezl4ukg87vxd2h5o' LIMIT 1
INSERT INTO "items_users" ("created_at", "item_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-21 03:27:44.380556"], ["item_id", 1], ["updated_at", "2015-03-21 03:27:44.380556"], ["user_id", 1]]
SELECT  "items_users".* FROM "items_users"  WHERE "items_users"."item_id" = 1 AND "items_users"."user_id" = 1 LIMIT 1
SELECT  "qrevents".* FROM "qrevents"  WHERE "qrevents"."cod" = 'hack_u_kosen' LIMIT 1
UPDATE "items_users" SET "amount" = ?, "updated_at" = ? WHERE "items_users"."id" = 1  [["amount", 15], ["updated_at", "2015-03-21 04:10:02.750528"]]