walker_server/app/controllers/users_controller.rb

	def preview
		@user = User.where(:name => 'JohnSmith' , :pass => 'testpass').first
---
SELECT  "users".* FROM "users"  WHERE "users"."name" = 'testuser' AND "users"."pass" = 'testpass'  ORDER BY "users"."id" ASC LIMIT 1