walker_server/app/controllers/users_controller.rb

	def preview
		@user = User.find(1)
		@questlist = Gpsquest.all
---
SELECT  "step_users".* FROM "step_users"  WHERE "step_users"."user_id" = 1 LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "gpsquests".* FROM "gpsquests"

  def create
    @user = User.new(user_params)
		@user.userhash = nil
		while !@user.userhash do
			tmp = ((1..9).to_a + ('a'..'z').to_a).sample(25).join
			@user.userhash = tmp if User.where(:userhash => tmp).empty?
		end
    respond_to do |format|
      if @user.save
				mystep = Step.new(:total_step => 0,:stock_step => 0)
				mystep.save
---
SELECT COUNT(*) FROM "users"  WHERE "users"."userhash" = 'u21mtne3iyzrdjoghp569kbv7'
INSERT INTO "step_users" ("created_at", "step_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-23 08:59:00.534146"], ["step_id", 2], ["updated_at", "2015-01-23 08:59:00.534146"], ["user_id", 2]]
INSERT INTO "users" ("created_at", "name", "pass", "updated_at", "userhash") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-01-22 17:50:14.047459"], ["name", "first"], ["pass", "passpass"], ["updated_at", "2015-01-22 17:50:14.047459"], ["userhash", "6z3eh5opnk7tmi1gl42r9v8cj"]]
INSERT INTO "steps" ("created_at", "stock_step", "total_step", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-23 09:24:53.613976"], ["stock_step", 0], ["total_step", 0], ["updated_at", "2015-01-23 09:24:53.613976"]]

  def destroy
		relation = StepUser.find_by_user_id(@user.id)
		mystep = Step.find(relation.step_id)
		relation.destroy
---
SELECT  "step_users".* FROM "step_users"  WHERE "step_users"."user_id" = 1 LIMIT 1
SELECT  "steps".* FROM "steps"  WHERE "steps"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "step_users" WHERE "step_users"."id" = ?  [["id", 1]]
DELETE FROM "steps" WHERE "steps"."id" = ?  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]