walker_server/app/views/users/preview.html.haml

%p
  - mystep = Step.find(StepUser.find_by_user_id(@user.id).step_id)
  - myrewards = Array.new
  - got_item_list = ItemsUsers.where(:user_id => @user.id)
  - got_item_list.each{ |x| myrewards.push(Item.find(x.item_id))}
---
SELECT  "step_users".* FROM "step_users"  WHERE "step_users"."user_id" = 1 LIMIT 1
SELECT "items_users".* FROM "items_users"  WHERE "items_users"."user_id" = 1
SELECT  "items".* FROM "items"  WHERE "items"."id" = ? LIMIT 1  [["id", 1]]